blog/2014-07-23-a-note-of-programming-clojure.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Sunday, December  4, 2022 at  4:43 PM -->
<meta charset="utf-8" />
<title>Clojure Programming</title>
<meta name="author" content="Kinhung Lam" />
<meta name="generator" content="Org Mode" />
<meta name="twitter:site" content="@twylo" />
<meta name="twitter:creator" content="@twylo" />
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
<link rel="me" href="https://weibo.com/u/2150445074" />
<link rel="icon" type="image/png" href="/images/icon/favicon-32x32.png" />
<link rel="apple-touch-icon-precomposed" href="/images/icon/apple-touch-icon.png" />
<link rel="alternate" type="application/rss+xml" title="Weblog RSS Feed" href="/blog/rss.xml" />
<link rel="stylesheet" type="text/css" href="/res/faces.css">
<link rel="stylesheet" type="text/css" href="/res/style.css">
</head>
<body>
<div id="preamble" class="status">
<a class="skip-nav-link" href="#content">
  Skip navigation
</a>
<nav>
  <div class="navitem"><a href="/">Home</a></div>
  <div class="navitem"><a href="/blog/">Weblog</a></div>
  <div class="navitem"><a href="/portfolio/">Portfolio</a></div>
  <div class="navitem"><a href="/resume.html">Resume</a></div>
  <div class="navitem"><a href="/contact.html">Contact</a></div>
</nav>
<div class="published">
Published Wednesday, July 23, 2014 at 11:02 AM
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Clojure Programming</h1>
</header><p>
1.use 用来导入clojure.core命名空间
</p>

<pre class="example" id="org1f342b3">
user&gt;(clojure.core/use 'clojure.core)
</pre>

<p>
2.import导入java类
</p>

<pre class="example" id="org6a4d67d">
user&gt;(import '(java.io InputStream File))
java.io.File
</pre>

<p>
3.require引入clj到当前命名空间
</p>

<pre class="example" id="org44632e7">
user&gt;(require 'clojure.string)
nil
</pre>

<p>
4.查看信息
</p>

<pre class="example" id="org74fb949">
user&gt;(find-doc "ns-")
</pre>

<p>
5.解构
</p>

<pre class="example" id="orgb4a794c">
user&gt;(let [[x y] [1 2 3]] 
            [x y])
[1 2]
user&gt; (greet-author-2 [fname {:first-name}]
            (println "hello, " fname))
; Evaluation aborted.
user&gt; (let [[_ _ z] [1 2 3]]
    z)
3
user&gt; (let [[_ _ z] [1 2 3]]
    _)
2
user&gt; (require '[clojure.string :as str])
nil
user&gt; (let [[x y :as coords] [1 2 3 4 5 6]]
        (str "x: " x ", y: " y ", total dimensions " (count                 coords)))
"x: 1, y: 2, total dimensions 6"
</pre>

<p>
6.常用数据类型
</p>

<pre class="example" id="orgd77ac3f">
Keyword   :tag, :doc
List     (1 2 3), (pringln "foo")
Map  {:name "bill", :age 42}
Set  #{:snap  :crackle  :pop}
Symbol    user/foo,
          java.lang.String
Vector   [1 2 3]
</pre>
</div>
<div id="postamble" class="status">
<div id="footer">
Proudly <a href="https://kinhung.me/blog/0110_emacs_blogging_for_fun_and_profit.html">published</a> with <a href="https://www.gnu.org/software/emacs/">Emacs</a> and <a href="https://orgmode.org/">Org Mode</a>. This work is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-sa/4.0/">CC BY-SA 4.0</a> License. <a href="https://kinhung.me/privacy.html">Privacy Policy</a></div>
</div>
</body>
</html>
